package dev.said;

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello World");

        // todo Lesson 05
        /*

1. Разработайте систему для управления курсами в учебном центре, которая выполняет
следующие операции
- создание курса со всеми атрибутами и назначением конкретного преподавателя
- добавлением студентов на курс
- журнал посещаемости
- бальная система
в текущей задаче использовать абстракцию, инкапсуляцию, наследование и
полиморфизм
2. Разработайте систему онлайн квиза
- создание квиза
- добавление вопросов
- добавление команд
- запуск квиза
- взаимодействие через консоль
- результаты
в текущей задаче использовать абстракцию, инкапсуляцию, наследование и
полиморфизм
        */
    }
}
